yt11dev.СК/src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

yt11dev.СК/src/AccumulationRegisters/СК_ТоварыНаСкладах/СК_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СК_ТоварыНаСкладах</name>
  <resources>
    <name>Вналичии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

yt11dev.СК/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

yt11dev.СК/src/Enums/ВидыДвиженияНакопления/ВидыДвиженияНакопления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="620f4fb1-f265-408c-a5dc-7f66421e133b">
  <name>ВидыДвиженияНакопления</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f0e7f236-529a-4492-b4b5-c6b0366e5eac">
    <name>Приход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="654dd705-8d30-4aca-8566-2942ac5e614b">
    <name>Расход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

yt11dev.СК/src/DataProcessors/СК_МобСклад/Forms/Корректировка/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
	АктивироватьПоиск();

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.ШКЯчейки.ОбновитьТекстРедактирования();
	Элементы.ШКЯчейки.Видимость = Ложь;
	Элементы.ШКЯчейки.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКЯчейки; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШКЯчейки = "";  
	ШКТовара = "";	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ШКЯчейки;
КонецПроцедуры

&НаСервере
Процедура ШКИзменениеТекстаРедактированияНаСервере(ШК)
	ЭтаФорма.Ячейка = Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(ШК)); 
	ЭтаФорма.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура ШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКИзменениеТекстаРедактированияНаСервере(Текст); 
	
	Если ЭтаФорма.Ячейка <> "" Тогда
		ЭтаФорма.Элементы.ШКТовара.РедактированиеТекста = Истина;
		АктивироватьПоискШКТовара();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоискШКТовара() 
	ОчиститьШКСервер(); 
	Элементы.ШКТовара.ОбновитьТекстРедактирования();
	Элементы.ШКТовара.Видимость = Ложь;
	Элементы.ШКТовара.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКТовара; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 


&НаКлиенте
Процедура Сохранить(Команда) 
	СохранитьНаСервере();
	Если ЭтаФорма.Контроль = Истина Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Сохранено",5,"Внимание!!!");
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"Произошла ошибка",5,"Внимание!!!");
	КонецЕсли;		
КонецПроцедуры 

&НаСервере
Процедура СохранитьНаСервере()
	Разница = ЭтаФорма.Количество - ЭтаФорма.Элементы.ТекКоличество.Заголовок;
	
	
	Если Разница > 0 Тогда  
		ВидДвижения = Перечисления.ВидыДвиженияНакопления.Приход;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		               |	СК_Корректировка.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.СК_Корректировка КАК СК_Корректировка
		               |ГДЕ
		               |	СК_Корректировка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И СК_Корректировка.ВидДвижения = &ВидДвижения
		               |	И СК_Корректировка.Проведен = &Проведен
		               |	И СК_Корректировка.ПометкаУдаления = &ПометкаУдаления"; 
			Запрос.УстановитьПараметр("ВидДвижения",Перечисления.ВидыДвиженияНакопления.Приход);

	Иначе
		ВидДвижения = Перечисления.ВидыДвиженияНакопления.Расход;

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		               |	СК_Корректировка.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.СК_Корректировка КАК СК_Корректировка
		               |ГДЕ
		               |	СК_Корректировка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И СК_Корректировка.ВидДвижения = &ВидДвижения
		               |	И СК_Корректировка.Проведен = &Проведен
		               |	И СК_Корректировка.ПометкаУдаления = &ПометкаУдаления"; 
		Запрос.УстановитьПараметр("ВидДвижения",Перечисления.ВидыДвиженияНакопления.Расход); 
		Разница = Разница * (-1);
	КонецЕсли;	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Проведен",Истина);
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
	
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Док = Рез.Ссылка.ПолучитьОбъект();
	Иначе
		Док = Документы.СК_Корректировка.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.ВидДвижения = ВидДвижения;
	КонецЕсли;                        
	
	Т = Док.Товары.Добавить();
	Т.Номенклатура = ЭтаФорма.Номенклатура;
	Т.Количество = Разница;
	Т.Время = ТекущаяДата();
	Т.Ячейка = ЭтаФорма.Ячейка;
	Т.ВидДвижения = ВидДвижения;
	
	Попытка
		Док.Записать(РежимЗаписиДокумента.Проведение);
		ЭтаФорма.Контроль = Истина;
	Исключение
		ЭтаФорма.Контроль = Ложь;
	КонецПопытки;

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Параметры) Экспорт
	ЭтаФорма.Закрыть();
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
	
	
КонецПроцедуры

&НаКлиенте
Процедура ШКТовараИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ШКТовараИзменениеТекстаРедактированияНаСервере(Текст);  
	Если ЭтаФорма.Элементы.ТекКоличество.Заголовок = "" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,"В ячейке нет товара !!!",5,"Внимание!!!");
	Иначе
		ЭтаФорма.Элементы.Количество.РедактированиеТекста = Истина;
		АктивироватьКоличество();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьКоличество() 
	ОчиститьШКСервер(); 
	Элементы.Количество.ОбновитьТекстРедактирования();
	Элементы.Количество.Видимость = Ложь;
	Элементы.Количество.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 


&НаСервере
Процедура ШКТовараИзменениеТекстаРедактированияНаСервере(ШК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |		ПО СК_ТоварыНаСкладахОстатки.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка
	               |	И ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
		Запрос.УстановитьПараметр("Ячейка",ЭтаФорма.Ячейка);
		Запрос.УстановитьПараметр("Штрихкод",ШК);
		Рез = Запрос.Выполнить().Выгрузить();
		
		ЭтаФорма.Элементы.ТекКоличество.Заголовок = "";
		
		Если Рез.Количество()>=1 Тогда 
			ЭтаФорма.Номенклатура = Рез[0].Номенклатура;
			ЭтаФорма.Элементы.ТекКоличество.Заголовок = Рез[0].ВналичииОстаток; 
		Иначе

		КонецЕсли;

КонецПроцедуры
